[{"paper":{"id":"2403.19270","authors":[{"_id":"6606447bf631d41ec45b1ac0","name":"Dahyun Kim","hidden":false},{"_id":"6606447bf631d41ec45b1ac1","name":"Yungi Kim","hidden":false},{"_id":"6606447bf631d41ec45b1ac2","name":"Wonho Song","hidden":false},{"_id":"6606447bf631d41ec45b1ac3","name":"Hyeonwoo Kim","hidden":false},{"_id":"6606447bf631d41ec45b1ac4","name":"Yunsu Kim","hidden":false},{"_id":"6606447bf631d41ec45b1ac5","name":"Sanghoon Kim","hidden":false},{"_id":"6606447bf631d41ec45b1ac6","name":"Chanjun Park","hidden":false}],"publishedAt":"2024-03-28T09:56:04.000Z","title":"sDPO: Don't Use Your Data All at Once","summary":"As development of large language models (LLM) progresses, aligning them with\nhuman preferences has become increasingly important. We propose stepwise DPO\n(sDPO), an extension of the recently popularized direct preference optimization\n(DPO) for alignment tuning. This approach involves dividing the available\npreference datasets and utilizing them in a stepwise manner, rather than\nemploying it all at once. We demonstrate that this method facilitates the use\nof more precisely aligned reference models within the DPO training framework.\nFurthermore, sDPO trains the final model to be more performant, even\noutperforming other popular LLMs with more parameters.","upvotes":15},"publishedAt":"2024-03-29T04:40:11.318Z","title":"sDPO: Don't Use Your Data All at Once","mediaUrl":"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2403.19270.png","numComments":2},{"paper":{"id":"2403.19046","authors":[{"_id":"660645469f5a7bd168fa41df","name":"De-An Huang","hidden":false},{"_id":"660645469f5a7bd168fa41e0","name":"Shijia Liao","hidden":false},{"_id":"660645469f5a7bd168fa41e1","name":"Subhashree Radhakrishnan","hidden":false},{"_id":"660645469f5a7bd168fa41e2","name":"Hongxu Yin","hidden":false},{"_id":"660645469f5a7bd168fa41e3","name":"Pavlo Molchanov","hidden":false},{"_id":"660645469f5a7bd168fa41e4","name":"Zhiding Yu","hidden":false},{"_id":"660645469f5a7bd168fa41e5","name":"Jan Kautz","hidden":false}],"publishedAt":"2024-03-27T22:50:48.000Z","title":"LITA: Language Instructed Temporal-Localization Assistant","summary":"There has been tremendous progress in multimodal Large Language Models\n(LLMs). Recent works have extended these models to video input with promising\ninstruction following capabilities. However, an important missing piece is\ntemporal localization. These models cannot accurately answer the \"When?\"\nquestions. We identify three key aspects that limit their temporal localization\ncapabilities: (i) time representation, (ii) architecture, and (iii) data. We\naddress these shortcomings by proposing Language Instructed\nTemporal-Localization Assistant (LITA) with the following features: (1) We\nintroduce time tokens that encode timestamps relative to the video length to\nbetter represent time in videos. (2) We introduce SlowFast tokens in the\narchitecture to capture temporal information at fine temporal resolution. (3)\nWe emphasize temporal localization data for LITA. In addition to leveraging\nexisting video datasets with timestamps, we propose a new task, Reasoning\nTemporal Localization (RTL), along with the dataset, ActivityNet-RTL, for\nlearning and evaluating this task. Reasoning temporal localization requires\nboth the reasoning and temporal localization of Video LLMs. LITA demonstrates\nstrong performance on this challenging task, nearly doubling the temporal mean\nintersection-over-union (mIoU) of baselines. In addition, we show that our\nemphasis on temporal localization also substantially improves video-based text\ngeneration compared to existing Video LLMs, including a 36% relative\nimprovement of Temporal Understanding. Code is available at:\nhttps://github.com/NVlabs/LITA","upvotes":12},"publishedAt":"2024-03-29T04:36:23.598Z","title":"LITA: Language Instructed Temporal-Localization Assistant","mediaUrl":"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2403.19046.png","numComments":1},{"paper":{"id":"2403.19655","authors":[{"_id":"660642d0b85b7b4ea5233a91","name":"Bowen Zhang","hidden":false},{"_id":"660642d0b85b7b4ea5233a92","name":"Yiji Cheng","hidden":false},{"_id":"660642d0b85b7b4ea5233a93","name":"Jiaolong Yang","hidden":false},{"_id":"660642d0b85b7b4ea5233a94","name":"Chunyu Wang","hidden":false},{"_id":"660642d0b85b7b4ea5233a95","name":"Feng Zhao","hidden":false},{"_id":"660642d0b85b7b4ea5233a96","name":"Yansong Tang","hidden":false},{"_id":"660642d0b85b7b4ea5233a97","name":"Dong Chen","hidden":false},{"_id":"660642d0b85b7b4ea5233a98","name":"Baining Guo","hidden":false}],"publishedAt":"2024-03-28T17:59:50.000Z","title":"GaussianCube: Structuring Gaussian Splatting using Optimal Transport for\n  3D Generative Modeling","summary":"3D Gaussian Splatting (GS) have achieved considerable improvement over Neural\nRadiance Fields in terms of 3D fitting fidelity and rendering speed. However,\nthis unstructured representation with scattered Gaussians poses a significant\nchallenge for generative modeling. To address the problem, we introduce\nGaussianCube, a structured GS representation that is both powerful and\nefficient for generative modeling. We achieve this by first proposing a\nmodified densification-constrained GS fitting algorithm which can yield\nhigh-quality fitting results using a fixed number of free Gaussians, and then\nre-arranging the Gaussians into a predefined voxel grid via Optimal Transport.\nThe structured grid representation allows us to use standard 3D U-Net as our\nbackbone in diffusion generative modeling without elaborate designs. Extensive\nexperiments conducted on ShapeNet and OmniObject3D show that our model achieves\nstate-of-the-art generation results both qualitatively and quantitatively,\nunderscoring the potential of GaussianCube as a powerful and versatile 3D\nrepresentation.","upvotes":11},"publishedAt":"2024-03-29T04:25:54.911Z","title":"GaussianCube: Structuring Gaussian Splatting using Optimal Transport for 3D Generative Modeling","mediaUrl":"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2403.19655.png","numComments":1},{"paper":{"id":"2403.18978","authors":[{"_id":"660639f5b85b7b4ea5216354","name":"Yanyu Li","hidden":false},{"_id":"660639f5b85b7b4ea5216355","name":"Xian Liu","hidden":false},{"_id":"660639f5b85b7b4ea5216356","name":"Anil Kag","hidden":false},{"_id":"660639f5b85b7b4ea5216357","name":"Ju Hu","hidden":false},{"_id":"660639f5b85b7b4ea5216358","name":"Yerlan Idelbayev","hidden":false},{"_id":"660639f5b85b7b4ea5216359","name":"Dhritiman Sagar","hidden":false},{"_id":"660639f5b85b7b4ea521635a","name":"Yanzhi Wang","hidden":false},{"_id":"660639f5b85b7b4ea521635b","name":"Sergey Tulyakov","hidden":false},{"_id":"660639f5b85b7b4ea521635c","name":"Jian Ren","hidden":false}],"publishedAt":"2024-03-27T19:52:55.000Z","title":"TextCraftor: Your Text Encoder Can be Image Quality Controller","summary":"Diffusion-based text-to-image generative models, e.g., Stable Diffusion, have\nrevolutionized the field of content generation, enabling significant\nadvancements in areas like image editing and video synthesis. Despite their\nformidable capabilities, these models are not without their limitations. It is\nstill challenging to synthesize an image that aligns well with the input text,\nand multiple runs with carefully crafted prompts are required to achieve\nsatisfactory results. To mitigate these limitations, numerous studies have\nendeavored to fine-tune the pre-trained diffusion models, i.e., UNet, utilizing\nvarious technologies. Yet, amidst these efforts, a pivotal question of\ntext-to-image diffusion model training has remained largely unexplored: Is it\npossible and feasible to fine-tune the text encoder to improve the performance\nof text-to-image diffusion models? Our findings reveal that, instead of\nreplacing the CLIP text encoder used in Stable Diffusion with other large\nlanguage models, we can enhance it through our proposed fine-tuning approach,\nTextCraftor, leading to substantial improvements in quantitative benchmarks and\nhuman assessments. Interestingly, our technique also empowers controllable\nimage generation through the interpolation of different text encoders\nfine-tuned with various rewards. We also demonstrate that TextCraftor is\northogonal to UNet finetuning, and can be combined to further improve\ngenerative quality.","upvotes":7},"publishedAt":"2024-03-29T03:48:11.268Z","title":"TextCraftor: Your Text Encoder Can be Image Quality Controller","mediaUrl":"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2403.18978.png","numComments":1},{"paper":{"id":"2403.19319","authors":[{"_id":"66063cf957778f7a192ec4bf","name":"Yujin Chen","hidden":false},{"_id":"66063cf957778f7a192ec4c0","name":"Yinyu Nie","hidden":false},{"_id":"66063cf957778f7a192ec4c1","name":"Benjamin Ummenhofer","hidden":false},{"_id":"66063cf957778f7a192ec4c2","name":"Reiner Birkl","hidden":false},{"_id":"66063cf957778f7a192ec4c3","name":"Michael Paulitsch","hidden":false},{"_id":"66063cf957778f7a192ec4c4","name":"Matthias Müller","hidden":false},{"_id":"66063cf957778f7a192ec4c5","name":"Matthias Nießner","hidden":false}],"publishedAt":"2024-03-28T11:22:53.000Z","title":"Mesh2NeRF: Direct Mesh Supervision for Neural Radiance Field\n  Representation and Generation","summary":"We present Mesh2NeRF, an approach to derive ground-truth radiance fields from\ntextured meshes for 3D generation tasks. Many 3D generative approaches\nrepresent 3D scenes as radiance fields for training. Their ground-truth\nradiance fields are usually fitted from multi-view renderings from a\nlarge-scale synthetic 3D dataset, which often results in artifacts due to\nocclusions or under-fitting issues. In Mesh2NeRF, we propose an analytic\nsolution to directly obtain ground-truth radiance fields from 3D meshes,\ncharacterizing the density field with an occupancy function featuring a defined\nsurface thickness, and determining view-dependent color through a reflection\nfunction considering both the mesh and environment lighting. Mesh2NeRF extracts\naccurate radiance fields which provides direct supervision for training\ngenerative NeRFs and single scene representation. We validate the effectiveness\nof Mesh2NeRF across various tasks, achieving a noteworthy 3.12dB improvement in\nPSNR for view synthesis in single scene representation on the ABO dataset, a\n0.69 PSNR enhancement in the single-view conditional generation of ShapeNet\nCars, and notably improved mesh extraction from NeRF in the unconditional\ngeneration of Objaverse Mugs.","upvotes":5},"publishedAt":"2024-03-29T04:01:00.943Z","title":"Mesh2NeRF: Direct Mesh Supervision for Neural Radiance Field Representation and Generation","mediaUrl":"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2403.19319.png","numComments":1}]