{
  "title": "VideoRAG: Retrieval-Augmented Generation over Video Corpus",
  "summary": "Retrieval-Augmented Generation (RAG) is a powerful strategy to address the\nissue of generating factually incorrect outputs in foundation models by\nretrieving external knowledge relevant to queries and incorporating it into\ntheir generation process. However, existing RAG approaches have primarily\nfocused on textual information, with some recent advancements beginning to\nconsider images, and they largely overlook videos, a rich source of multimodal\nknowledge capable of representing events, processes, and contextual details\nmore effectively than any other modality. While a few recent studies explore\nthe integration of videos in the response generation process, they either\npredefine query-associated videos without retrieving them according to queries,\nor convert videos into the textual descriptions without harnessing their\nmultimodal richness. To tackle these, we introduce VideoRAG, a novel framework\nthat not only dynamically retrieves relevant videos based on their relevance\nwith queries but also utilizes both visual and textual information of videos in\nthe output generation. Further, to operationalize this, our method revolves\naround the recent advance of Large Video Language Models (LVLMs), which enable\nthe direct processing of video content to represent it for retrieval and\nseamless integration of the retrieved videos jointly with queries. We\nexperimentally validate the effectiveness of VideoRAG, showcasing that it is\nsuperior to relevant baselines.",
  "translation": "标题：VideoRAG：基于视频语料库的检索增强生成\n\n摘要：检索增强生成（Retrieval-Augmented Generation, RAG）是一种强大的策略，通过检索与查询相关的外部知识并将其整合到生成过程中，来解决基础模型生成事实错误输出的问题。然而，现有的RAG方法主要集中于文本信息，最近的一些进展开始考虑图像，但它们大多忽略了视频这一丰富的多模态知识来源，视频能够比其他模态更有效地表示事件、过程和上下文细节。尽管最近的一些研究探索了在响应生成过程中整合视频的方法，但它们要么预先定义了与查询相关的视频而没有根据查询进行检索，要么将视频转换为文本描述而没有利用其多模态的丰富性。为了解决这些问题，我们提出了VideoRAG，这是一个新颖的框架，不仅根据查询动态检索相关视频，还在输出生成中利用视频的视觉和文本信息。此外，为了实现这一点，我们的方法围绕最近的大型视频语言模型（Large Video Language Models, LVLMs）的进展展开，这些模型能够直接处理视频内容以进行检索，并将检索到的视频与查询无缝整合。我们通过实验验证了VideoRAG的有效性，展示了其优于相关基线方法的表现。",
  "url": "https://huggingface.co/papers/2501.05874"
}