[
    {
        "title": "Uni-SMART: Universal Science Multimodal Analysis and Research\n  Transformer",
        "id": "2403.10301",
        "summary": "In scientific research and its application, scientific literature analysis is\ncrucial as it allows researchers to build on the work of others. However, the\nfast growth of scientific knowledge has led to a massive increase in scholarly\narticles, making in-depth literature analysis increasingly challenging and\ntime-consuming. The emergence of Large Language Models (LLMs) has offered a new\nway to address this challenge. Known for their strong abilities in summarizing\ntexts, LLMs are seen as a potential tool to improve the analysis of scientific\nliterature. However, existing LLMs have their own limits. Scientific literature\noften includes a wide range of multimodal elements, such as molecular\nstructure, tables, and charts, which are hard for text-focused LLMs to\nunderstand and analyze. This issue points to the urgent need for new solutions\nthat can fully understand and analyze multimodal content in scientific\nliterature. To answer this demand, we present Uni-SMART (Universal Science\nMultimodal Analysis and Research Transformer), an innovative model designed for\nin-depth understanding of multimodal scientific literature. Through rigorous\nquantitative evaluation across several domains, Uni-SMART demonstrates superior\nperformance over leading text-focused LLMs. Furthermore, our exploration\nextends to practical applications, including patent infringement detection and\nnuanced analysis of charts. These applications not only highlight Uni-SMART's\nadaptability but also its potential to revolutionize how we interact with\nscientific literature."
    },
    {
        "title": "VideoAgent: Long-form Video Understanding with Large Language Model as\n  Agent",
        "id": "2403.10517",
        "summary": "Long-form video understanding represents a significant challenge within\ncomputer vision, demanding a model capable of reasoning over long multi-modal\nsequences. Motivated by the human cognitive process for long-form video\nunderstanding, we emphasize interactive reasoning and planning over the ability\nto process lengthy visual inputs. We introduce a novel agent-based system,\nVideoAgent, that employs a large language model as a central agent to\niteratively identify and compile crucial information to answer a question, with\nvision-language foundation models serving as tools to translate and retrieve\nvisual information. Evaluated on the challenging EgoSchema and NExT-QA\nbenchmarks, VideoAgent achieves 54.1% and 71.3% zero-shot accuracy with only\n8.4 and 8.2 frames used on average. These results demonstrate superior\neffectiveness and efficiency of our method over the current state-of-the-art\nmethods, highlighting the potential of agent-based approaches in advancing\nlong-form video understanding."
    },
    {
        "title": "Recurrent Drafter for Fast Speculative Decoding in Large Language Models",
        "id": "2403.09919",
        "summary": "In this paper, we introduce an improved approach of speculative decoding\naimed at enhancing the efficiency of serving large language models. Our method\ncapitalizes on the strengths of two established techniques: the classic\ntwo-model speculative decoding approach, and the more recent single-model\napproach, Medusa. Drawing inspiration from Medusa, our approach adopts a\nsingle-model strategy for speculative decoding. However, our method\ndistinguishes itself by employing a single, lightweight draft head with a\nrecurrent dependency design, akin in essence to the small, draft model uses in\nclassic speculative decoding, but without the complexities of the full\ntransformer architecture. And because of the recurrent dependency, we can use\nbeam search to swiftly filter out undesired candidates with the draft head. The\noutcome is a method that combines the simplicity of single-model design and\navoids the need to create a data-dependent tree attention structure only for\ninference in Medusa. We empirically demonstrate the effectiveness of the\nproposed method on several popular open source language models, along with a\ncomprehensive analysis of the trade-offs involved in adopting this approach."
    },
    {
        "title": "RAFT: Adapting Language Model to Domain Specific RAG",
        "id": "2403.10131",
        "summary": "Pretraining Large Language Models (LLMs) on large corpora of textual data is\nnow a standard paradigm. When using these LLMs for many downstream\napplications, it is common to additionally bake in new knowledge (e.g.,\ntime-critical news, or private domain knowledge) into the pretrained model\neither through RAG-based-prompting, or fine-tuning. However, the optimal\nmethodology for the model to gain such new knowledge remains an open question.\nIn this paper, we present Retrieval Augmented FineTuning (RAFT), a training\nrecipe that improves the model's ability to answer questions in a \"open-book\"\nin-domain settings. In RAFT, given a question, and a set of retrieved\ndocuments, we train the model to ignore those documents that don't help in\nanswering the question, which we call, distractor documents. RAFT accomplishes\nthis by citing verbatim the right sequence from the relevant document that\nwould help answer the question. This coupled with RAFT's chain-of-thought-style\nresponse helps improve the model's ability to reason. In domain-specific RAG,\nRAFT consistently improves the model's performance across PubMed, HotpotQA, and\nGorilla datasets, presenting a post-training recipe to improve pre-trained LLMs\nto in-domain RAG. RAFT's code and demo are open-sourced at\ngithub.com/ShishirPatil/gorilla."
    },
    {
        "title": "MusicHiFi: Fast High-Fidelity Stereo Vocoding",
        "id": "2403.10493",
        "summary": "Diffusion-based audio and music generation models commonly generate music by\nconstructing an image representation of audio (e.g., a mel-spectrogram) and\nthen converting it to audio using a phase reconstruction model or vocoder.\nTypical vocoders, however, produce monophonic audio at lower resolutions (e.g.,\n16-24 kHz), which limits their effectiveness. We propose MusicHiFi -- an\nefficient high-fidelity stereophonic vocoder. Our method employs a cascade of\nthree generative adversarial networks (GANs) that convert low-resolution\nmel-spectrograms to audio, upsamples to high-resolution audio via bandwidth\nexpansion, and upmixes to stereophonic audio. Compared to previous work, we\npropose 1) a unified GAN-based generator and discriminator architecture and\ntraining procedure for each stage of our cascade, 2) a new fast, near\ndownsampling-compatible bandwidth extension module, and 3) a new fast\ndownmix-compatible mono-to-stereo upmixer that ensures the preservation of\nmonophonic content in the output. We evaluate our approach using both objective\nand subjective listening tests and find our approach yields comparable or\nbetter audio quality, better spatialization control, and significantly faster\ninference speed compared to past work. Sound examples are at\nhttps://MusicHiFi.github.io/web/."
    },
    {
        "title": "Controllable Text-to-3D Generation via Surface-Aligned Gaussian\n  Splatting",
        "id": "2403.09981",
        "summary": "While text-to-3D and image-to-3D generation tasks have received considerable\nattention, one important but under-explored field between them is controllable\ntext-to-3D generation, which we mainly focus on in this work. To address this\ntask, 1) we introduce Multi-view ControlNet (MVControl), a novel neural network\narchitecture designed to enhance existing pre-trained multi-view diffusion\nmodels by integrating additional input conditions, such as edge, depth, normal,\nand scribble maps. Our innovation lies in the introduction of a conditioning\nmodule that controls the base diffusion model using both local and global\nembeddings, which are computed from the input condition images and camera\nposes. Once trained, MVControl is able to offer 3D diffusion guidance for\noptimization-based 3D generation. And, 2) we propose an efficient multi-stage\n3D generation pipeline that leverages the benefits of recent large\nreconstruction models and score distillation algorithm. Building upon our\nMVControl architecture, we employ a unique hybrid diffusion guidance method to\ndirect the optimization process. In pursuit of efficiency, we adopt 3D\nGaussians as our representation instead of the commonly used implicit\nrepresentations. We also pioneer the use of SuGaR, a hybrid representation that\nbinds Gaussians to mesh triangle faces. This approach alleviates the issue of\npoor geometry in 3D Gaussians and enables the direct sculpting of fine-grained\ngeometry on the mesh. Extensive experiments demonstrate that our method\nachieves robust generalization and enables the controllable generation of\nhigh-quality 3D content."
    },
    {
        "title": "Alignment Studio: Aligning Large Language Models to Particular\n  Contextual Regulations",
        "id": "2403.09704",
        "summary": "The alignment of large language models is usually done by model providers to\nadd or control behaviors that are common or universally understood across use\ncases and contexts. In contrast, in this article, we present an approach and\narchitecture that empowers application developers to tune a model to their\nparticular values, social norms, laws and other regulations, and orchestrate\nbetween potentially conflicting requirements in context. We lay out three main\ncomponents of such an Alignment Studio architecture: Framers, Instructors, and\nAuditors that work in concert to control the behavior of a language model. We\nillustrate this approach with a running example of aligning a company's\ninternal-facing enterprise chatbot to its business conduct guidelines."
    },
    {
        "title": "Isotropic3D: Image-to-3D Generation Based on a Single CLIP Embedding",
        "id": "2403.10395",
        "summary": "Encouraged by the growing availability of pre-trained 2D diffusion models,\nimage-to-3D generation by leveraging Score Distillation Sampling (SDS) is\nmaking remarkable progress. Most existing methods combine novel-view lifting\nfrom 2D diffusion models which usually take the reference image as a condition\nwhile applying hard L2 image supervision at the reference view. Yet heavily\nadhering to the image is prone to corrupting the inductive knowledge of the 2D\ndiffusion model leading to flat or distorted 3D generation frequently. In this\nwork, we reexamine image-to-3D in a novel perspective and present Isotropic3D,\nan image-to-3D generation pipeline that takes only an image CLIP embedding as\ninput. Isotropic3D allows the optimization to be isotropic w.r.t. the azimuth\nangle by solely resting on the SDS loss. The core of our framework lies in a\ntwo-stage diffusion model fine-tuning. Firstly, we fine-tune a text-to-3D\ndiffusion model by substituting its text encoder with an image encoder, by\nwhich the model preliminarily acquires image-to-image capabilities. Secondly,\nwe perform fine-tuning using our Explicit Multi-view Attention (EMA) which\ncombines noisy multi-view images with the noise-free reference image as an\nexplicit condition. CLIP embedding is sent to the diffusion model throughout\nthe whole process while reference images are discarded once after fine-tuning.\nAs a result, with a single image CLIP embedding, Isotropic3D is capable of\ngenerating multi-view mutually consistent images and also a 3D model with more\nsymmetrical and neat content, well-proportioned geometry, rich colored texture,\nand less distortion compared with existing image-to-3D methods while still\npreserving the similarity to the reference image to a large extent. The project\npage is available at https://isotropic3d.github.io/. The code and models are\navailable at https://github.com/pkunliu/Isotropic3D."
    },
    {
        "title": "EfficientVMamba: Atrous Selective Scan for Light Weight Visual Mamba",
        "id": "2403.09977",
        "summary": "Prior efforts in light-weight model development mainly centered on CNN and\nTransformer-based designs yet faced persistent challenges. CNNs adept at local\nfeature extraction compromise resolution while Transformers offer global reach\nbut escalate computational demands O(N^2). This ongoing trade-off\nbetween accuracy and efficiency remains a significant hurdle. Recently, state\nspace models (SSMs), such as Mamba, have shown outstanding performance and\ncompetitiveness in various tasks such as language modeling and computer vision,\nwhile reducing the time complexity of global information extraction to\nO(N). Inspired by this, this work proposes to explore the potential\nof visual state space models in light-weight model design and introduce a novel\nefficient model variant dubbed EfficientVMamba. Concretely, our EfficientVMamba\nintegrates a atrous-based selective scan approach by efficient skip sampling,\nconstituting building blocks designed to harness both global and local\nrepresentational features. Additionally, we investigate the integration between\nSSM blocks and convolutions, and introduce an efficient visual state space\nblock combined with an additional convolution branch, which further elevate the\nmodel performance. Experimental results show that, EfficientVMamba scales down\nthe computational complexity while yields competitive results across a variety\nof vision tasks. For example, our EfficientVMamba-S with 1.3G FLOPs improves\nVim-Ti with 1.5G FLOPs by a large margin of 5.6% accuracy on ImageNet.\nCode is available at: https://github.com/TerryPei/EfficientVMamba."
    },
    {
        "title": "FDGaussian: Fast Gaussian Splatting from Single Image via\n  Geometric-aware Diffusion Model",
        "id": "2403.10242",
        "summary": "Reconstructing detailed 3D objects from single-view images remains a\nchallenging task due to the limited information available. In this paper, we\nintroduce FDGaussian, a novel two-stage framework for single-image 3D\nreconstruction. Recent methods typically utilize pre-trained 2D diffusion\nmodels to generate plausible novel views from the input image, yet they\nencounter issues with either multi-view inconsistency or lack of geometric\nfidelity. To overcome these challenges, we propose an orthogonal plane\ndecomposition mechanism to extract 3D geometric features from the 2D input,\nenabling the generation of consistent multi-view images. Moreover, we further\naccelerate the state-of-the-art Gaussian Splatting incorporating epipolar\nattention to fuse images from different viewpoints. We demonstrate that\nFDGaussian generates images with high consistency across different views and\nreconstructs high-quality 3D objects, both qualitatively and quantitatively.\nMore examples can be found at our website https://qjfeng.net/FDGaussian/."
    },
    {
        "title": "NeuFlow: Real-time, High-accuracy Optical Flow Estimation on Robots\n  Using Edge Devices",
        "id": "2403.10425",
        "summary": "Real-time high-accuracy optical flow estimation is a crucial component in\nvarious applications, including localization and mapping in robotics, object\ntracking, and activity recognition in computer vision. While recent\nlearning-based optical flow methods have achieved high accuracy, they often\ncome with heavy computation costs. In this paper, we propose a highly efficient\noptical flow architecture, called NeuFlow, that addresses both high accuracy\nand computational cost concerns. The architecture follows a global-to-local\nscheme. Given the features of the input images extracted at different spatial\nresolutions, global matching is employed to estimate an initial optical flow on\nthe 1/16 resolution, capturing large displacement, which is then refined on the\n1/8 resolution with lightweight CNN layers for better accuracy. We evaluate our\napproach on Jetson Orin Nano and RTX 2080 to demonstrate efficiency\nimprovements across different computing platforms. We achieve a notable 10x-80x\nspeedup compared to several state-of-the-art methods, while maintaining\ncomparable accuracy. Our approach achieves around 30 FPS on edge computing\nplatforms, which represents a significant breakthrough in deploying complex\ncomputer vision tasks such as SLAM on small robots like drones. The full\ntraining and evaluation code is available at\nhttps://github.com/neufieldrobotics/NeuFlow."
    }
]