[
    {
        "paper": {
            "id": "2411.02959",
            "authors": [
                {
                    "_id": "672ad53b6f6797b288015187",
                    "name": "Jiejun Tan",
                    "hidden": false
                },
                {
                    "_id": "672ad53b6f6797b288015188",
                    "name": "Zhicheng Dou",
                    "hidden": false
                },
                {
                    "_id": "672ad53b6f6797b288015189",
                    "name": "Wen Wang",
                    "hidden": false
                },
                {
                    "_id": "672ad53b6f6797b28801518a",
                    "name": "Mang Wang",
                    "hidden": false
                },
                {
                    "_id": "672ad53b6f6797b28801518b",
                    "name": "Weipeng Chen",
                    "hidden": false
                },
                {
                    "_id": "672ad53b6f6797b28801518c",
                    "name": "Ji-Rong Wen",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-05T09:58:36.000Z",
            "title": "HtmlRAG: HTML is Better Than Plain Text for Modeling Retrieved Knowledge\n  in RAG Systems",
            "summary": "Retrieval-Augmented Generation (RAG) has been shown to improve knowledge\ncapabilities and alleviate the hallucination problem of LLMs. The Web is a\nmajor source of external knowledge used in RAG systems, and many commercial\nsystems such as ChatGPT and Perplexity have used Web search engines as their\nmajor retrieval systems. Typically, such RAG systems retrieve search results,\ndownload HTML sources of the results, and then extract plain texts from the\nHTML sources. Plain text documents or chunks are fed into the LLMs to augment\nthe generation. However, much of the structural and semantic information\ninherent in HTML, such as headings and table structures, is lost during this\nplain-text-based RAG process. To alleviate this problem, we propose HtmlRAG,\nwhich uses HTML instead of plain text as the format of retrieved knowledge in\nRAG. We believe HTML is better than plain text in modeling knowledge in\nexternal documents, and most LLMs possess robust capacities to understand HTML.\nHowever, utilizing HTML presents new challenges. HTML contains additional\ncontent such as tags, JavaScript, and CSS specifications, which bring extra\ninput tokens and noise to the RAG system. To address this issue, we propose\nHTML cleaning, compression, and pruning strategies, to shorten the HTML while\nminimizing the loss of information. Specifically, we design a two-step\nblock-tree-based pruning method that prunes useless HTML blocks and keeps only\nthe relevant part of the HTML. Experiments on six QA datasets confirm the\nsuperiority of using HTML in RAG systems.",
            "upvotes": 28,
            "discussionId": "672ad53c6f6797b2880151d8"
        },
        "publishedAt": "2024-11-06T01:03:49.192Z",
        "title": "HtmlRAG: HTML is Better Than Plain Text for Modeling Retrieved Knowledge in RAG Systems",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.02959.png",
        "numComments": 3,
        "submittedBy": {
            "avatarUrl": "/avatars/a60642fc0ba81e4899f3e91afa3e692e.svg",
            "fullname": "Jiejun Tan",
            "name": "zstanjj",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false,
            "followerCount": 4
        }
    },
    {
        "paper": {
            "id": "2411.00871",
            "authors": [
                {
                    "_id": "672aed3f44b2453edfdbeafd",
                    "name": "Jinyoung Park",
                    "hidden": false
                },
                {
                    "_id": "672aed3f44b2453edfdbeafe",
                    "name": "Minseong Bae",
                    "hidden": false
                },
                {
                    "_id": "672aed3f44b2453edfdbeaff",
                    "name": "Dohwan Ko",
                    "hidden": false
                },
                {
                    "_id": "672aed3f44b2453edfdbeb00",
                    "name": "Hyunwoo J. Kim",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-10-31T03:56:05.000Z",
            "title": "LLaMo: Large Language Model-based Molecular Graph Assistant",
            "summary": "Large Language Models (LLMs) have demonstrated remarkable generalization and\ninstruction-following capabilities with instruction tuning. The advancements in\nLLMs and instruction tuning have led to the development of Large\nVision-Language Models (LVLMs). However, the competency of the LLMs and\ninstruction tuning have been less explored in the molecular domain. Thus, we\npropose LLaMo: Large Language Model-based Molecular graph assistant, which is\nan end-to-end trained large molecular graph-language model. To bridge the\ndiscrepancy between the language and graph modalities, we present the\nmulti-level graph projector that transforms graph representations into graph\ntokens by abstracting the output representations of each GNN layer and motif\nrepresentations with the cross-attention mechanism. We also introduce\nmachine-generated molecular graph instruction data to instruction-tune the\nlarge molecular graph-language model for general-purpose molecule and language\nunderstanding. Our extensive experiments demonstrate that LLaMo shows the best\nperformance on diverse tasks, such as molecular description generation,\nproperty prediction, and IUPAC name prediction. The code of LLaMo is available\nat https://github.com/mlvlab/LLaMo.",
            "upvotes": 13,
            "discussionId": "672aed4044b2453edfdbeb2c"
        },
        "publishedAt": "2024-11-06T02:46:13.869Z",
        "title": "LLaMo: Large Language Model-based Molecular Graph Assistant",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.00871.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "/avatars/829394448bbe53bf133d6315e51a90b7.svg",
            "fullname": "Dogyun Park",
            "name": "DogyunPark",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2411.02359",
            "authors": [
                {
                    "_id": "672ad61870734f59f1bdb3ea",
                    "name": "Yang Yue",
                    "hidden": false
                },
                {
                    "_id": "672ad61870734f59f1bdb3eb",
                    "name": "Yulin Wang",
                    "hidden": false
                },
                {
                    "_id": "672ad61870734f59f1bdb3ec",
                    "name": "Bingyi Kang",
                    "hidden": false
                },
                {
                    "_id": "672ad61870734f59f1bdb3ed",
                    "name": "Yizeng Han",
                    "hidden": false
                },
                {
                    "_id": "672ad61870734f59f1bdb3ee",
                    "name": "Shenzhi Wang",
                    "hidden": false
                },
                {
                    "_id": "672ad61870734f59f1bdb3ef",
                    "name": "Shiji Song",
                    "hidden": false
                },
                {
                    "_id": "672ad61870734f59f1bdb3f0",
                    "name": "Jiashi Feng",
                    "hidden": false
                },
                {
                    "_id": "672ad61870734f59f1bdb3f1",
                    "name": "Gao Huang",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-04T18:26:08.000Z",
            "title": "DeeR-VLA: Dynamic Inference of Multimodal Large Language Models for\n  Efficient Robot Execution",
            "summary": "MLLMs have demonstrated remarkable comprehension and reasoning capabilities\nwith complex language and visual data. These advances have spurred the vision\nof establishing a generalist robotic MLLM proficient in understanding complex\nhuman instructions and accomplishing various embodied tasks. However,\ndeveloping MLLMs for real-world robots is challenging due to the typically\nlimited computation and memory capacities available on robotic platforms. In\ncontrast, the inference of MLLMs involves storing billions of parameters and\nperforming tremendous computation, imposing significant hardware demands. In\nour paper, we propose a Dynamic Early-Exit Framework for Robotic\nVision-Language-Action Model (DeeR-VLA, or simply DeeR) that automatically\nadjusts the size of the activated MLLM based on each situation at hand. The\napproach leverages a multi-exit architecture in MLLMs, which allows the model\nto terminate processing once a proper size of the model has been activated for\na specific situation, thus avoiding further redundant computation.\nAdditionally, we develop novel algorithms that establish early-termination\ncriteria for DeeR, conditioned on predefined demands such as average\ncomputational cost (i.e., power consumption), as well as peak computational\nconsumption (i.e., latency) and GPU memory usage. These enhancements ensure\nthat DeeR operates efficiently under varying resource constraints while\nmaintaining competitive performance. On the CALVIN robot manipulation\nbenchmark, DeeR demonstrates significant reductions in computational costs of\nLLM by 5.2-6.5x and GPU memory of LLM by 2-6x without compromising performance.\nCode and checkpoints are available at https://github.com/yueyang130/DeeR-VLA.",
            "upvotes": 10,
            "discussionId": "672ad61870734f59f1bdb428"
        },
        "publishedAt": "2024-11-06T01:07:04.486Z",
        "title": "DeeR-VLA: Dynamic Inference of Multimodal Large Language Models for Efficient Robot Execution",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.02359.png",
        "numComments": 2,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/649d475111592b1a765ac1a3/rjORJjErJq-mthghan08U.jpeg",
            "fullname": "Yang Yue",
            "name": "Yang130",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2411.01493",
            "authors": [
                {
                    "_id": "672ad09444b2453edfd339a7",
                    "name": "Zichen Liu",
                    "hidden": false
                },
                {
                    "_id": "672ad09444b2453edfd339a8",
                    "name": "Changyu Chen",
                    "hidden": false
                },
                {
                    "_id": "672ad09444b2453edfd339a9",
                    "name": "Chao Du",
                    "hidden": false
                },
                {
                    "_id": "672ad09444b2453edfd339aa",
                    "name": "Wee Sun Lee",
                    "hidden": false
                },
                {
                    "_id": "672ad09444b2453edfd339ab",
                    "name": "Min Lin",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-03T09:18:28.000Z",
            "title": "Sample-Efficient Alignment for LLMs",
            "summary": "We study methods for efficiently aligning large language models (LLMs) with\nhuman preferences given budgeted online feedback. We first formulate the LLM\nalignment problem in the frame of contextual dueling bandits. This formulation,\nsubsuming recent paradigms such as online RLHF and online DPO, inherently\nquests for sample-efficient algorithms that incorporate online active\nexploration. Leveraging insights from bandit theory, we introduce a unified\nalgorithm based on Thompson sampling and highlight its applications in two\ndistinct LLM alignment scenarios. The practical agent that efficiently\nimplements this algorithm, named SEA (Sample-Efficient Alignment), is\nempirically validated through extensive experiments across three model scales\n(1B, 2.8B, 6.9B) and three preference learning algorithms (DPO, IPO, SLiC). The\nresults demonstrate that SEA achieves highly sample-efficient alignment with\noracle's preferences, outperforming recent active exploration methods for LLMs.\nAdditionally, we release the implementation of SEA together with an efficient\ncodebase designed for online alignment of LLMs, aiming to accelerate future\nresearch in this field.",
            "upvotes": 6,
            "discussionId": "672ad09544b2453edfd339ee"
        },
        "publishedAt": "2024-11-06T04:15:36.446Z",
        "title": "Sample-Efficient Alignment for LLMs",
        "mediaUrls": [
            "https://cdn-uploads.huggingface.co/production/uploads/64e416dc54e18f390ef79ba4/8MBI1a2JAp6jiik0Qemfg.jpeg"
        ],
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.01493.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/noauth/5n01J00ZaVRrebsON8iYA.jpeg",
            "fullname": "Changyu Chen",
            "name": "Cameron-Chen",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false,
            "followerCount": 2
        }
    },
    {
        "paper": {
            "id": "2410.23054",
            "authors": [
                {
                    "_id": "672b447c1b5f7a5e97a026e8",
                    "name": "Pau Rodriguez",
                    "hidden": false
                },
                {
                    "_id": "672b447c1b5f7a5e97a026e9",
                    "name": "Arno Blaas",
                    "hidden": false
                },
                {
                    "_id": "672b447c1b5f7a5e97a026ea",
                    "name": "Michal Klein",
                    "hidden": false
                },
                {
                    "_id": "672b447c1b5f7a5e97a026eb",
                    "name": "Luca Zappella",
                    "hidden": false
                },
                {
                    "_id": "672b447c1b5f7a5e97a026ec",
                    "name": "Nicholas Apostoloff",
                    "hidden": false
                },
                {
                    "_id": "672b447c1b5f7a5e97a026ed",
                    "name": "Marco Cuturi",
                    "hidden": false
                },
                {
                    "_id": "672b447c1b5f7a5e97a026ee",
                    "name": "Xavier Suau",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-10-30T14:21:33.000Z",
            "title": "Controlling Language and Diffusion Models by Transporting Activations",
            "summary": "The increasing capabilities of large generative models and their ever more\nwidespread deployment have raised concerns about their reliability, safety, and\npotential misuse. To address these issues, recent works have proposed to\ncontrol model generation by steering model activations in order to effectively\ninduce or prevent the emergence of concepts or behaviors in the generated\noutput. In this paper we introduce Activation Transport (AcT), a general\nframework to steer activations guided by optimal transport theory that\ngeneralizes many previous activation-steering works. AcT is modality-agnostic\nand provides fine-grained control over the model behavior with negligible\ncomputational overhead, while minimally impacting model abilities. We\nexperimentally show the effectiveness and versatility of our approach by\naddressing key challenges in large language models (LLMs) and text-to-image\ndiffusion models (T2Is). For LLMs, we show that AcT can effectively mitigate\ntoxicity, induce arbitrary concepts, and increase their truthfulness. In T2Is,\nwe show how AcT enables fine-grained style control and concept negation.",
            "upvotes": 5,
            "discussionId": "672b44871b5f7a5e97a0285a"
        },
        "publishedAt": "2024-11-06T09:15:03.290Z",
        "title": "Controlling Language and Diffusion Models by Transporting Activations",
        "mediaUrls": [
            "https://cdn-uploads.huggingface.co/production/uploads/64ba512141078fd9a059afaf/qodMtFxkm-gr-2Av8EF7W.gif",
            "https://cdn-uploads.huggingface.co/production/uploads/64ba512141078fd9a059afaf/RID9PXZOa9XyAGlhdkS4k.gif",
            "https://cdn-uploads.huggingface.co/production/uploads/64ba512141078fd9a059afaf/uZ432VtM78N0WwKyolhM-.gif"
        ],
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2410.23054.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "/avatars/6095fa8cca5e3ae8a4699a9595fc8f71.svg",
            "fullname": "Pau Rodriguez",
            "name": "prlz77",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2411.01602",
            "authors": [
                {
                    "_id": "672afacd7b58518d3534070f",
                    "name": "Yean Cheng",
                    "hidden": false
                },
                {
                    "_id": "672afacd7b58518d35340710",
                    "user": {
                        "_id": "659fa7002c4538d113c7296a",
                        "avatarUrl": "/avatars/eff46ce65ce83e09b8223bad335cd0fc.svg",
                        "isPro": false,
                        "fullname": "Ziqi  Cai",
                        "user": "GhostCai",
                        "type": "user"
                    },
                    "name": "Ziqi Cai",
                    "status": "extracted_pending",
                    "statusLastChangedAt": "2024-11-06T05:12:50.129Z",
                    "hidden": false
                },
                {
                    "_id": "672afacd7b58518d35340711",
                    "name": "Ming Ding",
                    "hidden": false
                },
                {
                    "_id": "672afacd7b58518d35340712",
                    "name": "Wendi Zheng",
                    "hidden": false
                },
                {
                    "_id": "672afacd7b58518d35340713",
                    "name": "Shiyu Huang",
                    "hidden": false
                },
                {
                    "_id": "672afacd7b58518d35340714",
                    "name": "Yuxiao Dong",
                    "hidden": false
                },
                {
                    "_id": "672afacd7b58518d35340715",
                    "name": "Jie Tang",
                    "hidden": false
                },
                {
                    "_id": "672afacd7b58518d35340716",
                    "name": "Boxin Shi",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-03T15:15:01.000Z",
            "title": "DreamPolish: Domain Score Distillation With Progressive Geometry\n  Generation",
            "summary": "We introduce DreamPolish, a text-to-3D generation model that excels in\nproducing refined geometry and high-quality textures. In the geometry\nconstruction phase, our approach leverages multiple neural representations to\nenhance the stability of the synthesis process. Instead of relying solely on a\nview-conditioned diffusion prior in the novel sampled views, which often leads\nto undesired artifacts in the geometric surface, we incorporate an additional\nnormal estimator to polish the geometry details, conditioned on viewpoints with\nvarying field-of-views. We propose to add a surface polishing stage with only a\nfew training steps, which can effectively refine the artifacts attributed to\nlimited guidance from previous stages and produce 3D objects with more\ndesirable geometry. The key topic of texture generation using pretrained\ntext-to-image models is to find a suitable domain in the vast latent\ndistribution of these models that contains photorealistic and consistent\nrenderings. In the texture generation phase, we introduce a novel score\ndistillation objective, namely domain score distillation (DSD), to guide neural\nrepresentations toward such a domain. We draw inspiration from the\nclassifier-free guidance (CFG) in textconditioned image generation tasks and\nshow that CFG and variational distribution guidance represent distinct aspects\nin gradient guidance and are both imperative domains for the enhancement of\ntexture quality. Extensive experiments show our proposed model can produce 3D\nassets with polished surfaces and photorealistic textures, outperforming\nexisting state-of-the-art methods.",
            "upvotes": 5,
            "discussionId": "672afad27b58518d35340828"
        },
        "publishedAt": "2024-11-06T03:43:19.758Z",
        "title": "DreamPolish: Domain Score Distillation With Progressive Geometry Generation",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.01602.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "/avatars/c5fce792792cc0b52ed7475d72460c58.svg",
            "fullname": "Yean Cheng",
            "name": "LiquidAmmonia",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2411.02657",
            "authors": [
                {
                    "_id": "672aed54405316929b0fd3f7",
                    "user": {
                        "_id": "6515dc0cca07b261439e8f0d",
                        "avatarUrl": "/avatars/f9eb37ade965a8d99bb50e357498e545.svg",
                        "isPro": false,
                        "fullname": "karthik soman",
                        "user": "ksoman",
                        "type": "user"
                    },
                    "name": "Karthik Soman",
                    "status": "extracted_confirmed",
                    "statusLastChangedAt": "2024-11-06T04:29:00.534Z",
                    "hidden": false
                },
                {
                    "_id": "672aed54405316929b0fd3f8",
                    "name": "Andrew Langdon",
                    "hidden": false
                },
                {
                    "_id": "672aed54405316929b0fd3f9",
                    "name": "Catalina Villouta",
                    "hidden": false
                },
                {
                    "_id": "672aed54405316929b0fd3fa",
                    "name": "Chinmay Agrawal",
                    "hidden": false
                },
                {
                    "_id": "672aed54405316929b0fd3fb",
                    "name": "Lashaw Salta",
                    "hidden": false
                },
                {
                    "_id": "672aed54405316929b0fd3fc",
                    "name": "Braian Peetoom",
                    "hidden": false
                },
                {
                    "_id": "672aed54405316929b0fd3fd",
                    "name": "Gianmarco Bellucci",
                    "hidden": false
                },
                {
                    "_id": "672aed54405316929b0fd3fe",
                    "name": "Orion J Buske",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-04T22:45:52.000Z",
            "title": "Zebra-Llama: A Context-Aware Large Language Model for Democratizing Rare\n  Disease Knowledge",
            "summary": "Rare diseases present unique challenges in healthcare, often suffering from\ndelayed diagnosis and fragmented information landscapes. The scarcity of\nreliable knowledge in these conditions poses a distinct challenge for Large\nLanguage Models (LLMs) in supporting clinical management and delivering precise\npatient information underscoring the need for focused training on these 'zebra'\ncases. We present Zebra-Llama, a specialized context-aware language model with\nhigh precision Retrieval Augmented Generation (RAG) capability, focusing on\nEhlers-Danlos Syndrome (EDS) as our case study. EDS, affecting 1 in 5,000\nindividuals, exemplifies the complexities of rare diseases with its diverse\nsymptoms, multiple subtypes, and evolving diagnostic criteria. By implementing\na novel context-aware fine-tuning methodology trained on questions derived from\nmedical literature, patient experiences, and clinical resources, along with\nexpertly curated responses, Zebra-Llama demonstrates unprecedented capabilities\nin handling EDS-related queries. On a test set of real-world questions\ncollected from EDS patients and clinicians, medical experts evaluated the\nresponses generated by both models, revealing Zebra-Llama's substantial\nimprovements over base model (Llama 3.1-8B-Instruct) in thoroughness (77.5% vs.\n70.1%), accuracy (83.0% vs. 78.8%), clarity (74.7% vs. 72.0%) and citation\nreliability (70.6% vs. 52.3%). Released as an open-source resource, Zebra-Llama\nnot only provides more accessible and reliable EDS information but also\nestablishes a framework for developing specialized AI solutions for other rare\nconditions. This work represents a crucial step towards democratizing\nexpert-level knowledge in rare disease management, potentially transforming how\nhealthcare providers and patients navigate the complex landscape of rare\ndiseases.",
            "upvotes": 3,
            "discussionId": "672aed55405316929b0fd453"
        },
        "publishedAt": "2024-11-06T02:52:12.125Z",
        "title": "Zebra-Llama: A Context-Aware Large Language Model for Democratizing Rare Disease Knowledge",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.02657.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "/avatars/f9eb37ade965a8d99bb50e357498e545.svg",
            "fullname": "karthik soman",
            "name": "ksoman",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false,
            "followerCount": 4
        }
    },
    {
        "paper": {
            "id": "2411.03047",
            "authors": [
                {
                    "_id": "672b539f70734f59f1e4e657",
                    "name": "Zhongjin Luo",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e658",
                    "name": "Haolin Liu",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e659",
                    "name": "Chenghong Li",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e65a",
                    "name": "Wanghao Du",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e65b",
                    "name": "Zirong Jin",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e65c",
                    "name": "Wanhu Sun",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e65d",
                    "name": "Yinyu Nie",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e65e",
                    "name": "Weikai Chen",
                    "hidden": false
                },
                {
                    "_id": "672b539f70734f59f1e4e65f",
                    "name": "Xiaoguang Han",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-05T12:30:07.000Z",
            "title": "GarVerseLOD: High-Fidelity 3D Garment Reconstruction from a Single\n  In-the-Wild Image using a Dataset with Levels of Details",
            "summary": "Neural implicit functions have brought impressive advances to the\nstate-of-the-art of clothed human digitization from multiple or even single\nimages. However, despite the progress, current arts still have difficulty\ngeneralizing to unseen images with complex cloth deformation and body poses. In\nthis work, we present GarVerseLOD, a new dataset and framework that paves the\nway to achieving unprecedented robustness in high-fidelity 3D garment\nreconstruction from a single unconstrained image. Inspired by the recent\nsuccess of large generative models, we believe that one key to addressing the\ngeneralization challenge lies in the quantity and quality of 3D garment data.\nTowards this end, GarVerseLOD collects 6,000 high-quality cloth models with\nfine-grained geometry details manually created by professional artists. In\naddition to the scale of training data, we observe that having disentangled\ngranularities of geometry can play an important role in boosting the\ngeneralization capability and inference accuracy of the learned model. We hence\ncraft GarVerseLOD as a hierarchical dataset with levels of details (LOD),\nspanning from detail-free stylized shape to pose-blended garment with\npixel-aligned details. This allows us to make this highly under-constrained\nproblem tractable by factorizing the inference into easier tasks, each narrowed\ndown with smaller searching space. To ensure GarVerseLOD can generalize well to\nin-the-wild images, we propose a novel labeling paradigm based on conditional\ndiffusion models to generate extensive paired images for each garment model\nwith high photorealism. We evaluate our method on a massive amount of\nin-the-wild images. Experimental results demonstrate that GarVerseLOD can\ngenerate standalone garment pieces with significantly better quality than prior\napproaches. Project page: https://garverselod.github.io/",
            "upvotes": 2,
            "discussionId": "672b53a470734f59f1e4e801"
        },
        "publishedAt": "2024-11-06T10:19:13.885Z",
        "title": "GarVerseLOD: High-Fidelity 3D Garment Reconstruction from a Single In-the-Wild Image using a Dataset with Levels of Details",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.03047.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "/avatars/455f2de6dab9504c154dad708a1fb74d.svg",
            "fullname": "Zhongjin",
            "name": "xiaojin66",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2411.02844",
            "authors": [
                {
                    "_id": "672b05326a68baea5e5605c1",
                    "user": {
                        "_id": "664ae70790135abe9ba76c28",
                        "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/noauth/37UBGlDiISXd0oqQJyP41.png",
                        "isPro": false,
                        "fullname": "Matthias Bartolo",
                        "user": "mbar0075",
                        "type": "user"
                    },
                    "name": "Matthias Bartolo",
                    "status": "extracted_confirmed",
                    "statusLastChangedAt": "2024-11-06T05:57:22.713Z",
                    "hidden": false
                },
                {
                    "_id": "672b05326a68baea5e5605c2",
                    "name": "Dylan Seychell",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-05T06:34:19.000Z",
            "title": "Correlation of Object Detection Performance with Visual Saliency and\n  Depth Estimation",
            "summary": "As object detection techniques continue to evolve, understanding their\nrelationships with complementary visual tasks becomes crucial for optimising\nmodel architectures and computational resources. This paper investigates the\ncorrelations between object detection accuracy and two fundamental visual\ntasks: depth prediction and visual saliency prediction. Through comprehensive\nexperiments using state-of-the-art models (DeepGaze IIE, Depth Anything,\nDPT-Large, and Itti's model) on COCO and Pascal VOC datasets, we find that\nvisual saliency shows consistently stronger correlations with object detection\naccuracy (mArho up to 0.459 on Pascal VOC) compared to depth prediction\n(mArho up to 0.283). Our analysis reveals significant variations in these\ncorrelations across object categories, with larger objects showing correlation\nvalues up to three times higher than smaller objects. These findings suggest\nincorporating visual saliency features into object detection architectures\ncould be more beneficial than depth information, particularly for specific\nobject categories. The observed category-specific variations also provide\ninsights for targeted feature engineering and dataset design improvements,\npotentially leading to more efficient and accurate object detection systems.",
            "upvotes": 2,
            "discussionId": "672b05336a68baea5e560616"
        },
        "publishedAt": "2024-11-06T09:16:37.199Z",
        "title": "Correlation of Object Detection Performance with Visual Saliency and Depth Estimation",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.02844.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/noauth/37UBGlDiISXd0oqQJyP41.png",
            "fullname": "Matthias Bartolo",
            "name": "mbar0075",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false,
            "followerCount": 2
        }
    },
    {
        "paper": {
            "id": "2411.02393",
            "authors": [
                {
                    "_id": "672b801f26c6716f52485c26",
                    "name": "Shivam Duggal",
                    "hidden": false
                },
                {
                    "_id": "672b801f26c6716f52485c27",
                    "name": "Phillip Isola",
                    "hidden": false
                },
                {
                    "_id": "672b801f26c6716f52485c28",
                    "name": "Antonio Torralba",
                    "hidden": false
                },
                {
                    "_id": "672b801f26c6716f52485c29",
                    "name": "William T. Freeman",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-04T18:58:01.000Z",
            "title": "Adaptive Length Image Tokenization via Recurrent Allocation",
            "summary": "Current vision systems typically assign fixed-length representations to\nimages, regardless of the information content. This contrasts with human\nintelligence - and even large language models - which allocate varying\nrepresentational capacities based on entropy, context and familiarity. Inspired\nby this, we propose an approach to learn variable-length token representations\nfor 2D images. Our encoder-decoder architecture recursively processes 2D image\ntokens, distilling them into 1D latent tokens over multiple iterations of\nrecurrent rollouts. Each iteration refines the 2D tokens, updates the existing\n1D latent tokens, and adaptively increases representational capacity by adding\nnew tokens. This enables compression of images into a variable number of\ntokens, ranging from 32 to 256. We validate our tokenizer using reconstruction\nloss and FID metrics, demonstrating that token count aligns with image entropy,\nfamiliarity and downstream task requirements. Recurrent token processing with\nincreasing representational capacity in each iteration shows signs of token\nspecialization, revealing potential for object / part discovery.",
            "upvotes": 1,
            "discussionId": "672b802426c6716f52485d35"
        },
        "publishedAt": "2024-11-06T15:16:58.134Z",
        "title": "Adaptive Length Image Tokenization via Recurrent Allocation",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.02393.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/64d98ef7a4839890b25eb78b/215-CSVLl81z6CAq0ECWU.jpeg",
            "fullname": "Fangyuan Yu",
            "name": "Ksgk-fy",
            "type": "user",
            "isPro": true,
            "isHf": false,
            "isMod": false,
            "followerCount": 11
        }
    },
    {
        "paper": {
            "id": "2411.03312",
            "authors": [
                {
                    "_id": "672b7c4f5963af3fe187091e",
                    "name": "Kevin Y. Li",
                    "hidden": false
                },
                {
                    "_id": "672b7c4f5963af3fe187091f",
                    "name": "Sachin Goyal",
                    "hidden": false
                },
                {
                    "_id": "672b7c4f5963af3fe1870920",
                    "name": "Joao D. Semedo",
                    "hidden": false
                },
                {
                    "_id": "672b7c4f5963af3fe1870921",
                    "name": "J. Zico Kolter",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-11-05T18:54:21.000Z",
            "title": "Inference Optimal VLMs Need Only One Visual Token but Larger Models",
            "summary": "Vision Language Models (VLMs) have demonstrated strong capabilities across\nvarious visual understanding and reasoning tasks. However, their real-world\ndeployment is often constrained by high latency during inference due to\nsubstantial compute required to process the large number of input tokens\n(predominantly from the image) by the LLM. To reduce inference costs, one can\neither downsize the LLM or reduce the number of input image-tokens, the latter\nof which has been the focus of many recent works around token compression.\nHowever, it is unclear what the optimal trade-off is, as both the factors\ndirectly affect the VLM performance. We first characterize this optimal\ntrade-off between the number of visual tokens and LLM parameters by\nestablishing scaling laws that capture variations in performance with these two\nfactors. Our results reveal a surprising trend: for visual reasoning tasks, the\ninference-optimal behavior in VLMs, i.e., minimum downstream error at any given\nfixed inference compute, is achieved when using the largest LLM that fits\nwithin the inference budget while minimizing visual token count - often to a\nsingle token. While the token reduction literature has mainly focused on\nmaintaining base model performance by modestly reducing the token count (e.g.,\n5-10times), our results indicate that the compute-optimal inference regime\nrequires operating under even higher token compression ratios. Based on these\ninsights, we take some initial steps towards building approaches tailored for\nhigh token compression settings. Code is available at\nhttps://github.com/locuslab/llava-token-compression.",
            "upvotes": 1,
            "discussionId": "672b7c505963af3fe1870981"
        },
        "publishedAt": "2024-11-06T12:57:50.414Z",
        "title": "Inference Optimal VLMs Need Only One Visual Token but Larger Models",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2411.03312.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/64d98ef7a4839890b25eb78b/215-CSVLl81z6CAq0ECWU.jpeg",
            "fullname": "Fangyuan Yu",
            "name": "Ksgk-fy",
            "type": "user",
            "isPro": true,
            "isHf": false,
            "isMod": false,
            "followerCount": 11
        }
    }
]