[
    {
        "paper": {
            "id": "2409.08857",
            "authors": [
                {
                    "_id": "66e836da9ebf20e0639f3541",
                    "name": "Joonghyuk Shin",
                    "hidden": false
                },
                {
                    "_id": "66e836da9ebf20e0639f3542",
                    "name": "Daehyeon Choi",
                    "hidden": false
                },
                {
                    "_id": "66e836da9ebf20e0639f3543",
                    "name": "Jaesik Park",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-09-13T14:19:27.000Z",
            "title": "InstantDrag: Improving Interactivity in Drag-based Image Editing",
            "summary": "Drag-based image editing has recently gained popularity for its interactivity\nand precision. However, despite the ability of text-to-image models to generate\nsamples within a second, drag editing still lags behind due to the challenge of\naccurately reflecting user interaction while maintaining image content. Some\nexisting approaches rely on computationally intensive per-image optimization or\nintricate guidance-based methods, requiring additional inputs such as masks for\nmovable regions and text prompts, thereby compromising the interactivity of the\nediting process. We introduce InstantDrag, an optimization-free pipeline that\nenhances interactivity and speed, requiring only an image and a drag\ninstruction as input. InstantDrag consists of two carefully designed networks:\na drag-conditioned optical flow generator (FlowGen) and an optical\nflow-conditioned diffusion model (FlowDiffusion). InstantDrag learns motion\ndynamics for drag-based image editing in real-world video datasets by\ndecomposing the task into motion generation and motion-conditioned image\ngeneration. We demonstrate InstantDrag's capability to perform fast,\nphoto-realistic edits without masks or text prompts through experiments on\nfacial video datasets and general scenes. These results highlight the\nefficiency of our approach in handling drag-based image editing, making it a\npromising solution for interactive, real-time applications.",
            "upvotes": 8,
            "discussionId": "66e836dd9ebf20e0639f36d6"
        },
        "publishedAt": "2024-09-16T12:17:13.296Z",
        "title": "InstantDrag: Improving Interactivity in Drag-based Image Editing",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2409.08857.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/1674929746905-60f1abe7544c2adfd699860c.jpeg",
            "fullname": "AK",
            "name": "akhaliq",
            "type": "user",
            "isPro": false,
            "isHf": true,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2409.08353",
            "authors": [
                {
                    "_id": "66e79c7195bb7553ed7600f4",
                    "name": "Yuheng Jiang",
                    "hidden": false
                },
                {
                    "_id": "66e79c7195bb7553ed7600f5",
                    "name": "Zhehao Shen",
                    "hidden": false
                },
                {
                    "_id": "66e79c7195bb7553ed7600f6",
                    "name": "Yu Hong",
                    "hidden": false
                },
                {
                    "_id": "66e79c7195bb7553ed7600f7",
                    "user": {
                        "_id": "64e4a9e6b78bc92221b2909e",
                        "avatarUrl": "/avatars/b57b879d43fafa457cbad77dc4d387b1.svg",
                        "isPro": false,
                        "fullname": "fy",
                        "user": "chengchengguo123",
                        "type": "user"
                    },
                    "name": "Chengcheng Guo",
                    "status": "admin_assigned",
                    "statusLastChangedAt": "2024-09-16T07:36:08.414Z",
                    "hidden": false
                },
                {
                    "_id": "66e79c7195bb7553ed7600f8",
                    "name": "Yize Wu",
                    "hidden": false
                },
                {
                    "_id": "66e79c7195bb7553ed7600f9",
                    "name": "Yingliang Zhang",
                    "hidden": false
                },
                {
                    "_id": "66e79c7195bb7553ed7600fa",
                    "user": {
                        "_id": "63ffcec6e7767a89533b8f80",
                        "avatarUrl": "/avatars/b9e8673943741c2e7b80b15a061bb951.svg",
                        "isPro": false,
                        "fullname": "JINGYI Yu",
                        "user": "Daluuu",
                        "type": "user"
                    },
                    "name": "Jingyi Yu",
                    "status": "admin_assigned",
                    "statusLastChangedAt": "2024-09-16T07:34:41.916Z",
                    "hidden": false
                },
                {
                    "_id": "66e79c7195bb7553ed7600fb",
                    "name": "Lan Xu",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-09-12T18:33:13.000Z",
            "title": "Robust Dual Gaussian Splatting for Immersive Human-centric Volumetric\n  Videos",
            "summary": "Volumetric video represents a transformative advancement in visual media,\nenabling users to freely navigate immersive virtual experiences and narrowing\nthe gap between digital and real worlds. However, the need for extensive manual\nintervention to stabilize mesh sequences and the generation of excessively\nlarge assets in existing workflows impedes broader adoption. In this paper, we\npresent a novel Gaussian-based approach, dubbed DualGS, for real-time\nand high-fidelity playback of complex human performance with excellent\ncompression ratios. Our key idea in DualGS is to separately represent motion\nand appearance using the corresponding skin and joint Gaussians. Such an\nexplicit disentanglement can significantly reduce motion redundancy and enhance\ntemporal coherence. We begin by initializing the DualGS and anchoring skin\nGaussians to joint Gaussians at the first frame. Subsequently, we employ a\ncoarse-to-fine training strategy for frame-by-frame human performance modeling.\nIt includes a coarse alignment phase for overall motion prediction as well as a\nfine-grained optimization for robust tracking and high-fidelity rendering. To\nintegrate volumetric video seamlessly into VR environments, we efficiently\ncompress motion using entropy encoding and appearance using codec compression\ncoupled with a persistent codebook. Our approach achieves a compression ratio\nof up to 120 times, only requiring approximately 350KB of storage per frame. We\ndemonstrate the efficacy of our representation through photo-realistic,\nfree-view experiences on VR headsets, enabling users to immersively watch\nmusicians in performance and feel the rhythm of the notes at the performers'\nfingertips.",
            "upvotes": 6,
            "discussionId": "66e79c7595bb7553ed76024c"
        },
        "publishedAt": "2024-09-16T01:18:24.798Z",
        "title": "Robust Dual Gaussian Splatting for Immersive Human-centric Volumetric Videos",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2409.08353.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/1674929746905-60f1abe7544c2adfd699860c.jpeg",
            "fullname": "AK",
            "name": "akhaliq",
            "type": "user",
            "isPro": false,
            "isHf": true,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2409.08947",
            "authors": [
                {
                    "_id": "66e8381119f4837cdfe210c4",
                    "name": "Yohan Poirier-Ginter",
                    "hidden": false
                },
                {
                    "_id": "66e8381119f4837cdfe210c5",
                    "name": "Alban Gauthier",
                    "hidden": false
                },
                {
                    "_id": "66e8381119f4837cdfe210c6",
                    "name": "Julien Phillip",
                    "hidden": false
                },
                {
                    "_id": "66e8381119f4837cdfe210c7",
                    "name": "Jean-Francois Lalonde",
                    "hidden": false
                },
                {
                    "_id": "66e8381119f4837cdfe210c8",
                    "name": "George Drettakis",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-09-13T16:07:25.000Z",
            "title": "A Diffusion Approach to Radiance Field Relighting using\n  Multi-Illumination Synthesis",
            "summary": "Relighting radiance fields is severely underconstrained for multi-view data,\nwhich is most often captured under a single illumination condition; It is\nespecially hard for full scenes containing multiple objects. We introduce a\nmethod to create relightable radiance fields using such single-illumination\ndata by exploiting priors extracted from 2D image diffusion models. We first\nfine-tune a 2D diffusion model on a multi-illumination dataset conditioned by\nlight direction, allowing us to augment a single-illumination capture into a\nrealistic -- but possibly inconsistent -- multi-illumination dataset from\ndirectly defined light directions. We use this augmented data to create a\nrelightable radiance field represented by 3D Gaussian splats. To allow direct\ncontrol of light direction for low-frequency lighting, we represent appearance\nwith a multi-layer perceptron parameterized on light direction. To enforce\nmulti-view consistency and overcome inaccuracies we optimize a per-image\nauxiliary feature vector. We show results on synthetic and real multi-view data\nunder single illumination, demonstrating that our method successfully exploits\n2D diffusion model priors to allow realistic 3D relighting for complete scenes.\nProject site\nhttps://repo-sam.inria.fr/fungraph/generative-radiance-field-relighting/",
            "upvotes": 5,
            "discussionId": "66e8381319f4837cdfe211b5"
        },
        "publishedAt": "2024-09-16T12:22:27.623Z",
        "title": "A Diffusion Approach to Radiance Field Relighting using Multi-Illumination Synthesis",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2409.08947.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/1674929746905-60f1abe7544c2adfd699860c.jpeg",
            "fullname": "AK",
            "name": "akhaliq",
            "type": "user",
            "isPro": false,
            "isHf": true,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2409.08615",
            "authors": [
                {
                    "_id": "66e8303b89d2a8527c891d52",
                    "name": "Jie Zhou",
                    "hidden": false
                },
                {
                    "_id": "66e8303b89d2a8527c891d53",
                    "name": "Chufeng Xiao",
                    "hidden": false
                },
                {
                    "_id": "66e8303b89d2a8527c891d54",
                    "name": "Miu-Ling Lam",
                    "hidden": false
                },
                {
                    "_id": "66e8303b89d2a8527c891d55",
                    "name": "Hongbo Fu",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-09-13T08:05:20.000Z",
            "title": "DrawingSpinUp: 3D Animation from Single Character Drawings",
            "summary": "Animating various character drawings is an engaging visual content creation\ntask. Given a single character drawing, existing animation methods are limited\nto flat 2D motions and thus lack 3D effects. An alternative solution is to\nreconstruct a 3D model from a character drawing as a proxy and then retarget 3D\nmotion data onto it. However, the existing image-to-3D methods could not work\nwell for amateur character drawings in terms of appearance and geometry. We\nobserve the contour lines, commonly existing in character drawings, would\nintroduce significant ambiguity in texture synthesis due to their\nview-dependence. Additionally, thin regions represented by single-line contours\nare difficult to reconstruct (e.g., slim limbs of a stick figure) due to their\ndelicate structures. To address these issues, we propose a novel system,\nDrawingSpinUp, to produce plausible 3D animations and breathe life into\ncharacter drawings, allowing them to freely spin up, leap, and even perform a\nhip-hop dance. For appearance improvement, we adopt a removal-then-restoration\nstrategy to first remove the view-dependent contour lines and then render them\nback after retargeting the reconstructed character. For geometry refinement, we\ndevelop a skeleton-based thinning deformation algorithm to refine the slim\nstructures represented by the single-line contours. The experimental\nevaluations and a perceptual user study show that our proposed method\noutperforms the existing 2D and 3D animation methods and generates high-quality\n3D animations from a single character drawing. Please refer to our project page\n(https://lordliang.github.io/DrawingSpinUp) for the code and generated\nanimations.",
            "upvotes": 4,
            "discussionId": "66e8304089d2a8527c891df5"
        },
        "publishedAt": "2024-09-16T11:49:00.388Z",
        "title": "DrawingSpinUp: 3D Animation from Single Character Drawings",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2409.08615.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/1674929746905-60f1abe7544c2adfd699860c.jpeg",
            "fullname": "AK",
            "name": "akhaliq",
            "type": "user",
            "isPro": false,
            "isHf": true,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2409.08514",
            "authors": [
                {
                    "_id": "66e82fd4f9d6b6c5066a6e84",
                    "user": {
                        "_id": "6387676c23da90491eb9fb16",
                        "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/1669818175965-noauth.jpeg",
                        "isPro": false,
                        "fullname": "Kai Li",
                        "user": "JusperLee",
                        "type": "user"
                    },
                    "name": "Kai Li",
                    "status": "extracted_confirmed",
                    "statusLastChangedAt": "2024-09-16T13:33:53.393Z",
                    "hidden": false
                },
                {
                    "_id": "66e82fd4f9d6b6c5066a6e85",
                    "name": "Yi Luo",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-09-13T03:25:34.000Z",
            "title": "Apollo: Band-sequence Modeling for High-Quality Audio Restoration",
            "summary": "Audio restoration has become increasingly significant in modern society, not\nonly due to the demand for high-quality auditory experiences enabled by\nadvanced playback devices, but also because the growing capabilities of\ngenerative audio models necessitate high-fidelity audio. Typically, audio\nrestoration is defined as a task of predicting undistorted audio from damaged\ninput, often trained using a GAN framework to balance perception and\ndistortion. Since audio degradation is primarily concentrated in mid- and\nhigh-frequency ranges, especially due to codecs, a key challenge lies in\ndesigning a generator capable of preserving low-frequency information while\naccurately reconstructing high-quality mid- and high-frequency content.\nInspired by recent advancements in high-sample-rate music separation, speech\nenhancement, and audio codec models, we propose Apollo, a generative model\ndesigned for high-sample-rate audio restoration. Apollo employs an explicit\nfrequency band split module to model the relationships between different\nfrequency bands, allowing for more coherent and higher-quality restored audio.\nEvaluated on the MUSDB18-HQ and MoisesDB datasets, Apollo consistently\noutperforms existing SR-GAN models across various bit rates and music genres,\nparticularly excelling in complex scenarios involving mixtures of multiple\ninstruments and vocals. Apollo significantly improves music restoration quality\nwhile maintaining computational efficiency. The source code for Apollo is\npublicly available at https://github.com/JusperLee/Apollo.",
            "upvotes": 4,
            "discussionId": "66e82fd5f9d6b6c5066a6ecd"
        },
        "publishedAt": "2024-09-16T11:47:26.584Z",
        "title": "Apollo: Band-sequence Modeling for High-Quality Audio Restoration",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2409.08514.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/1674929746905-60f1abe7544c2adfd699860c.jpeg",
            "fullname": "AK",
            "name": "akhaliq",
            "type": "user",
            "isPro": false,
            "isHf": true,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2409.08513",
            "authors": [
                {
                    "_id": "66e82f60e6c22fa18351df70",
                    "name": "Haoxuan Wang",
                    "hidden": false
                },
                {
                    "_id": "66e82f60e6c22fa18351df71",
                    "name": "Qingdong He",
                    "hidden": false
                },
                {
                    "_id": "66e82f60e6c22fa18351df72",
                    "name": "Jinlong Peng",
                    "hidden": false
                },
                {
                    "_id": "66e82f60e6c22fa18351df73",
                    "name": "Hao Yang",
                    "hidden": false
                },
                {
                    "_id": "66e82f60e6c22fa18351df74",
                    "name": "Mingmin Chi",
                    "hidden": false
                },
                {
                    "_id": "66e82f60e6c22fa18351df75",
                    "name": "Yabiao Wang",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-09-13T03:23:52.000Z",
            "title": "Mamba-YOLO-World: Marrying YOLO-World with Mamba for Open-Vocabulary\n  Detection",
            "summary": "Open-vocabulary detection (OVD) aims to detect objects beyond a predefined\nset of categories. As a pioneering model incorporating the YOLO series into\nOVD, YOLO-World is well-suited for scenarios prioritizing speed and\nefficiency.However, its performance is hindered by its neck feature fusion\nmechanism, which causes the quadratic complexity and the limited guided\nreceptive fields.To address these limitations, we present Mamba-YOLO-World, a\nnovel YOLO-based OVD model employing the proposed MambaFusion Path Aggregation\nNetwork (MambaFusion-PAN) as its neck architecture. Specifically, we introduce\nan innovative State Space Model-based feature fusion mechanism consisting of a\nParallel-Guided Selective Scan algorithm and a Serial-Guided Selective Scan\nalgorithm with linear complexity and globally guided receptive fields. It\nleverages multi-modal input sequences and mamba hidden states to guide the\nselective scanning process.Experiments demonstrate that our model outperforms\nthe original YOLO-World on the COCO and LVIS benchmarks in both zero-shot and\nfine-tuning settings while maintaining comparable parameters and FLOPs.\nAdditionally, it surpasses existing state-of-the-art OVD methods with fewer\nparameters and FLOPs.",
            "upvotes": 3,
            "discussionId": "66e82f61e6c22fa18351dfcd"
        },
        "publishedAt": "2024-09-16T11:45:45.312Z",
        "title": "Mamba-YOLO-World: Marrying YOLO-World with Mamba for Open-Vocabulary Detection",
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2409.08513.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "https://cdn-avatars.huggingface.co/v1/production/uploads/1674929746905-60f1abe7544c2adfd699860c.jpeg",
            "fullname": "AK",
            "name": "akhaliq",
            "type": "user",
            "isPro": false,
            "isHf": true,
            "isMod": false
        }
    },
    {
        "paper": {
            "id": "2409.08272",
            "authors": [
                {
                    "_id": "66e83376a3f5a4cad5ebde9b",
                    "name": "Omer Regev",
                    "hidden": false
                },
                {
                    "_id": "66e83376a3f5a4cad5ebde9c",
                    "name": "Omri Avrahami",
                    "hidden": false
                },
                {
                    "_id": "66e83376a3f5a4cad5ebde9d",
                    "name": "Dani Lischinski",
                    "hidden": false
                }
            ],
            "publishedAt": "2024-09-12T17:59:04.000Z",
            "title": "Click2Mask: Local Editing with Dynamic Mask Generation",
            "summary": "Recent advancements in generative models have revolutionized image generation\nand editing, making these tasks accessible to non-experts. This paper focuses\non local image editing, particularly the task of adding new content to a\nloosely specified area. Existing methods often require a precise mask or a\ndetailed description of the location, which can be cumbersome and prone to\nerrors. We propose Click2Mask, a novel approach that simplifies the local\nediting process by requiring only a single point of reference (in addition to\nthe content description). A mask is dynamically grown around this point during\na Blended Latent Diffusion (BLD) process, guided by a masked CLIP-based\nsemantic loss. Click2Mask surpasses the limitations of segmentation-based and\nfine-tuning dependent methods, offering a more user-friendly and contextually\naccurate solution. Our experiments demonstrate that Click2Mask not only\nminimizes user effort but also delivers competitive or superior local image\nmanipulation results compared to SoTA methods, according to both human\njudgement and automatic metrics. Key contributions include the simplification\nof user input, the ability to freely add objects unconstrained by existing\nsegments, and the integration potential of our dynamic mask approach within\nother editing methods.",
            "upvotes": 2,
            "discussionId": "66e8337aa3f5a4cad5ebe059"
        },
        "publishedAt": "2024-09-16T12:04:22.429Z",
        "title": "Click2Mask: Local Editing with Dynamic Mask Generation",
        "mediaUrls": [
            "https://cdn-uploads.huggingface.co/production/uploads/62f6ab4fc3372328414c8689/fRXW6a0qOqo2VV9HjTfwO.mp4"
        ],
        "thumbnail": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2409.08272.png",
        "numComments": 1,
        "submittedBy": {
            "avatarUrl": "/avatars/4f728a5b70c9fe4a64e80e2b643ca620.svg",
            "fullname": "Omri Avrahami",
            "name": "omriav",
            "type": "user",
            "isPro": false,
            "isHf": false,
            "isMod": false
        }
    }
]